# BumpmapDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BumpMap..::..BumpmapDepth Property
BumpMap Class See Also
---
The property labeled "Amount" from the "BumpMap" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string BumpmapDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BumpmapDepth As String
	Get
```

Visual C++
---
```text
public:
static property String^ BumpmapDepth {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance".
# See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace